pehill-5-cases-OpenFOAM/case_1p2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(0.00148591 -1.76297e-07 0)
(0.00150957 -2.2268e-07 0)
(0.00153369 -1.02299e-07 3.97044e-25)
(0.00155029 -5.29713e-08 -6.6234e-25)
(0.00156491 2.10188e-08 2.59537e-25)
(0.00157334 9.76232e-08 -1.11001e-26)
(0.0015771 1.54313e-07 1.11083e-26)
(0.00157685 2.21686e-07 -3.4664e-26)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
